Revit 2027 API
ParameterTypeId.RbsFlexPipeTypeParam Property
 "Flex Pipe"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsFlexPipeTypeParam { get; }
Public Shared ReadOnly Property RbsFlexPipeTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsFlexPipeTypeParam {
	ForgeTypeId^ get ();
}
static member RbsFlexPipeTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace